[
  {
    "id": "01",
    "institution": "John Hopkins University",
    "title": "HTML, CSS and Javascript from Web Developers",
    "skills": "HTML, Web Development, HTML and CSS, CSS, Web",
    "rating": "4.7",
    "reviews": "14.3k",
    "applicable_for": "Beginner",
    "certification": "Mixed",
    "duration": "1-3 months",
    "photo_URL": "https://images.unsplash.com/photo-1593720213428-28a5b9e94613?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
    "price": "45",
    "about": "Do you realize that the only functionality of a web application that the user directly interacts with is through the web page? Implement it poorly and, to the user, the server-side becomes irrelevant! Today’s user expects a lot out of the web page: it has to load fast, expose the desired service, and be comfortable to view on all devices: from a desktop computers to tablets and mobile phones."
  },
  {
    "id": "02",
    "institution": "Meta",
    "title": "Meta Front-End Developer",
    "skills": "HTML, Web Development, HTML, CSS, Javascript",
    "rating": "4.7",
    "reviews": "2.7k",
    "applicable_for": "Beginner",
    "certification": "Professional",
    "duration": "1-3 months",
    "photo_URL": "https://images.unsplash.com/photo-1457305237443-44c3d5a30b89?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=874&q=80",
    "price": "50",
    "about": "Want to get started in the world of coding and build beautiful websites as a career? This 9-course program, designed by the software engineering experts at Meta, will prepare you for a career as a front-end developer. Once you complete the program, you’ll get access to the Meta Career Programs Job Board—a job search platform that connects you with 200+ employers who have committed to sourcing talent through Meta’s certificate programs, as well as career support resources to help you with your job search."
  },
  {
    "id": "03",
    "institution": "University of Michigan",
    "title": "Web Design for Everybody: Basics of Web Development & Coding",
    "skills": "Computer Graphics, Computer Programming, Web Development, HTML and CSS, CSS, Web",
    "rating": "4.7",
    "reviews": "32.7k",
    "applicable_for": "Beginner",
    "certification": "Specialization",
    "duration": "3-6 months",
    "photo_URL": "https://images.unsplash.com/photo-1545670723-196ed0954986?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=873&q=80",
    "price": "48",
    "about": "This Specialization covers how to write syntactically correct HTML5 and CSS3, and how to create interactive web experiences with JavaScript. Mastering this range of technologies will allow you to develop high quality web sites that, work seamlessly on mobile, tablet, and large screen browsers accessible. During the capstone you will develop a professional-quality web portfolio demonstrating your growth as a web developer and your knowledge of accessible web design. This will include your ability to design and implement a responsive site that utilizes tools to create a site that is accessible to a wide audience, including those with visual, audial, physical, and cognitive impairments."
  },
  {
    "id": "04",
    "institution": "IBM Skills Network",
    "title": "HTML, CSS and Javascript from Web Developers",
    "skills": "Computer Programming, Application Development, Web Development, HTML and CSS, Back-End Web",
    "rating": "4.6",
    "reviews": "32k",
    "applicable_for": "Beginner",
    "certification": "Professional",
    "duration": "3-6 months",
    "photo_URL": "https://images.unsplash.com/photo-1499951360447-b19be8fe80f5?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
    "price": "55",
    "about": "This Professional Certificate will equip you with all the key skills and technical know-how to kickstart your career as a Full-Stack Cloud Native Application Developer. Guided by experts at IBM, you will learn to build your own cloud-based applications and practice working with the technologies behind them. This program consists of ample instructional content as well as hands-on exercises and projects designed to hone your skills and help you build your portfolio."
  },
  {
    "id": "05",
    "institution": "The Hong Kong University of Science and Technology",
    "title": "Full-Stack Web Development with React",
    "skills": "Computer Programming, Application Development, Authentication, Cloud, Back-End Web",
    "rating": "4.7",
    "reviews": "11.6k",
    "applicable_for": "Beginner",
    "certification": "Professional",
    "duration": "3-6 months",
    "photo_URL": "https://images.unsplash.com/photo-1583508915901-b5f84c1dcde1?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
    "price": "42",
    "about": "Learn front-end and hybrid mobile development, with server-side support, for implementing a multi-platform solution. The first two courses in this Specialization cover front-end frameworks: Bootstrap 4 and React. On the server side, you’ll learn to implement NoSQL databases using MongoDB, work within a Node.js environment and Express framework, and communicate to the client side through a RESTful API. Learners enrolling in this Specialization are expected to have prior working knowledge of HTML, CSS and JavaScript. Ideally learners should complete the courses in the specified sequence. "
  },
  {
    "id": "06",
    "institution": "University of California, Davis",
    "title": "Introduction to Web Development",
    "skills": "Web, Web Development Tools, HTML, Web Design, Application Development",
    "rating": "4.7",
    "reviews": "3.4k",
    "applicable_for": "Beginner",
    "certification": "Professional",
    "duration": "1-3 months",
    "photo_URL": "https://images.unsplash.com/photo-1571171637578-41bc2dd41cd2?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2070&q=80",
    "price": "60",
    "about": "This course is designed to start you on a path toward future studies in web development and design, no matter how little experience or technical knowledge you currently have. The web is a very big place, and if you are the typical internet user, you probably visit several websites every day, whether for business, entertainment or education. But have you ever wondered how these websites actually work? How are they built? How do browsers, computers, and mobile devices interact with the web? What skills are necessary to build a website? With almost 1 billion websites now on the internet, the answers to these questions could be your first step toward a better understanding of the internet and developing a new set of internet skills."
  }
]
